xsession/openocd/tcl/packs/Microchip/dsPIC33F-GP-MC_DFP/1.4.235/edc/DSPIC33FJ32MC104.PIC
        <edc:AdjustPoint edc:offset="8" edc:_addr="0x778"/>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="FEXL" edc:desc="" edc:impl="0xffff" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="FEXL" edc:nzwidth="0x10" edc:por="0000000000000000" edc:_addr="0x780">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FEXL" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="FEXL" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--------nnnnnnnn" edc:cname="FEXU" edc:desc="" edc:impl="0x0" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------00000000" edc:name="FEXU" edc:nzwidth="0x10" edc:por="--------00000000" edc:_addr="0x782">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FEXU" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="FEXU" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="VISI" edc:desc="" edc:impl="0xffff" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="VISI" edc:nzwidth="0x10" edc:por="0000000000000000" edc:_addr="0x784">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="VISI" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="VISI" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="DPCL" edc:desc="" edc:impl="0xffff" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="DPCL" edc:nzwidth="0x10" edc:por="0000000000000000" edc:_addr="0x786">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DPCL" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="DPCL" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--------nnnnnnnn" edc:cname="DPCU" edc:desc="" edc:impl="0x0" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------00000000" edc:name="DPCU" edc:nzwidth="0x10" edc:por="--------00000000" edc:_addr="0x788">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DPCU" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="DPCU" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="60" edc:_addr="0x78A"/>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="DFTADD" edc:desc="" edc:impl="0xffff" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="DFTADD" edc:nzwidth="0x10" edc:por="0000000000000000" edc:_addr="0x7C6">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DFTADD" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="DFTADD" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="DFTDATA" edc:desc="" edc:impl="0xffff" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="DFTDATA" edc:nzwidth="0x10" edc:por="0000000000000000" edc:_addr="0x7C8">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DFTDATA" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="DFTDATA" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="DFTDATA_INC" edc:desc="" edc:impl="0xffff" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="DFTDATA_INC" edc:nzwidth="0x10" edc:por="0000000000000000" edc:_addr="0x7CA">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DFTDATA_INC" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="DFTDATA_INC" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:EmulatorSector edc:beginaddr="0xFD0000" edc:endaddr="0xfd003e" edc:regionid="emulreg"/>
      <edc:GPRDataSector edc:beginaddr="0x800" edc:endaddr="0x1000" edc:regionid="data"/>
    </edc:RegardlessOfMode>
    <edc:TraditionalModeOnly/>
    <edc:ExtendedModeOnly/>
  </edc:DataSpace>
  <edc:PinList edc:ppsflavor="complex">
    <edc:Pin>
      <edc:VirtualPin edc:name="RB9"/>
      <edc:VirtualPin edc:name="CN21"/>
      <edc:VirtualPin edc:name="RP9"/>
      <edc:VirtualPin edc:name="SDA1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC6"/>
      <edc:VirtualPin edc:name="CN18"/>
      <edc:VirtualPin edc:name="RP22"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC7"/>
      <edc:VirtualPin edc:name="CN17"/>
      <edc:VirtualPin edc:name="RP23"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC8"/>
      <edc:VirtualPin edc:name="CN20"/>
      <edc:VirtualPin edc:name="RP24"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC9"/>
      <edc:VirtualPin edc:name="CN19"/>
      <edc:VirtualPin edc:name="RP25"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VCAP"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB10"/>
      <edc:VirtualPin edc:name="CN16"/>
      <edc:VirtualPin edc:name="RP10"/>
      <edc:VirtualPin edc:name="PWM1H3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB11"/>
      <edc:VirtualPin edc:name="CN15"/>
      <edc:VirtualPin edc:name="RP11"/>
      <edc:VirtualPin edc:name="PWM1L3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB12"/>
      <edc:VirtualPin edc:name="CN14"/>
      <edc:VirtualPin edc:name="RP12"/>
      <edc:VirtualPin edc:name="PWM1H2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB13"/>
      <edc:VirtualPin edc:name="CN13"/>
      <edc:VirtualPin edc:name="RP13"/>
      <edc:VirtualPin edc:name="PWM1L2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA10"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA7"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB14"/>
      <edc:VirtualPin edc:name="CN12"/>
      <edc:VirtualPin edc:name="RP14"/>
      <edc:VirtualPin edc:name="RTCC"/>
      <edc:VirtualPin edc:name="PWM1H1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB15"/>
      <edc:VirtualPin edc:name="CN11"/>
      <edc:VirtualPin edc:name="RP15"/>
      <edc:VirtualPin edc:name="PWM1L1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AVSS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AVDD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="MCLR"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA0"/>
      <edc:VirtualPin edc:name="CN2"/>
      <edc:VirtualPin edc:name="CTED1"/>
      <edc:VirtualPin edc:name="C1INA"/>
      <edc:VirtualPin edc:name="C3INB"/>
      <edc:VirtualPin edc:name="AN0"/>
      <edc:VirtualPin edc:name="PGED2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA1"/>
      <edc:VirtualPin edc:name="CN3"/>
      <edc:VirtualPin edc:name="CTED2"/>
      <edc:VirtualPin edc:name="C1INB"/>
      <edc:VirtualPin edc:name="C3INA"/>
      <edc:VirtualPin edc:name="AN1"/>
      <edc:VirtualPin edc:name="PGEC2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB0"/>
      <edc:VirtualPin edc:name="CN4"/>
      <edc:VirtualPin edc:name="RP0"/>
      <edc:VirtualPin edc:name="CTCMP"/>
      <edc:VirtualPin edc:name="C1INC"/>
      <edc:VirtualPin edc:name="C2INA"/>
      <edc:VirtualPin edc:name="AN2"/>
      <edc:VirtualPin edc:name="PGED1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB1"/>
      <edc:VirtualPin edc:name="CN5"/>
      <edc:VirtualPin edc:name="RP1"/>
      <edc:VirtualPin edc:name="C1IND"/>
      <edc:VirtualPin edc:name="C2INB"/>
      <edc:VirtualPin edc:name="CVREFO"/>
      <edc:VirtualPin edc:name="CVREFI"/>
      <edc:VirtualPin edc:name="AN3"/>
      <edc:VirtualPin edc:name="PGEC1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB2"/>
      <edc:VirtualPin edc:name="CN6"/>
      <edc:VirtualPin edc:name="RP2"/>
      <edc:VirtualPin edc:name="C2INC"/>
      <edc:VirtualPin edc:name="C3INC"/>
      <edc:VirtualPin edc:name="AN4"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB3"/>
      <edc:VirtualPin edc:name="CN7"/>
      <edc:VirtualPin edc:name="RP3"/>
      <edc:VirtualPin edc:name="C2IND"/>
      <edc:VirtualPin edc:name="C3IND"/>
      <edc:VirtualPin edc:name="AN5"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC0"/>
      <edc:VirtualPin edc:name="CN8"/>
      <edc:VirtualPin edc:name="RP16"/>
      <edc:VirtualPin edc:name="AN6"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC1"/>
      <edc:VirtualPin edc:name="CN9"/>
      <edc:VirtualPin edc:name="RP17"/>
      <edc:VirtualPin edc:name="AN7"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC2"/>
      <edc:VirtualPin edc:name="CN10"/>
      <edc:VirtualPin edc:name="RP18"/>
      <edc:VirtualPin edc:name="AN8"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA2"/>
      <edc:VirtualPin edc:name="CN30"/>
      <edc:VirtualPin edc:name="CLKI"/>
      <edc:VirtualPin edc:name="OSC1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA3"/>
      <edc:VirtualPin edc:name="CN29"/>
      <edc:VirtualPin edc:name="CLKO"/>
      <edc:VirtualPin edc:name="OSC2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA8"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB4"/>
      <edc:VirtualPin edc:name="CN1"/>
      <edc:VirtualPin edc:name="RP4"/>
      <edc:VirtualPin edc:name="AN9"/>
      <edc:VirtualPin edc:name="SOSCI"/>
      <edc:VirtualPin edc:name="PGED3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA4"/>
      <edc:VirtualPin edc:name="CN0"/>
      <edc:VirtualPin edc:name="T1CK"/>
      <edc:VirtualPin edc:name="AN10"/>
      <edc:VirtualPin edc:name="SOSCO"/>
      <edc:VirtualPin edc:name="PGEC3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA9"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC3"/>
      <edc:VirtualPin edc:name="CN28"/>
      <edc:VirtualPin edc:name="RP19"/>
      <edc:VirtualPin edc:name="AN11"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC4"/>
      <edc:VirtualPin edc:name="CN25"/>
      <edc:VirtualPin edc:name="RP20"/>
      <edc:VirtualPin edc:name="AN12"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC5"/>
      <edc:VirtualPin edc:name="CN26"/>
      <edc:VirtualPin edc:name="RP21"/>
      <edc:VirtualPin edc:name="AN15"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB5"/>
      <edc:VirtualPin edc:name="CN27"/>
      <edc:VirtualPin edc:name="RP5"/>
      <edc:VirtualPin edc:name="ASDA1"/>
      <edc:VirtualPin edc:name="FLTB"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB6"/>
      <edc:VirtualPin edc:name="CN24"/>
      <edc:VirtualPin edc:name="RP6"/>
      <edc:VirtualPin edc:name="ASCL1"/>
      <edc:VirtualPin edc:name="FLTA"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB7"/>
      <edc:VirtualPin edc:name="CN23"/>
      <edc:VirtualPin edc:name="RP7"/>
      <edc:VirtualPin edc:name="INT0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB8"/>
      <edc:VirtualPin edc:name="CN22"/>
      <edc:VirtualPin edc:name="RP8"/>
      <edc:VirtualPin edc:name="SCL1"/>
    </edc:Pin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="INT1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="INT2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T2CK"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T3CK"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T4CK"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T5CK"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="OCFA"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U1RX"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U1CTS"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SDI1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SCK1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SS1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="C1OUT" edc:ppsval="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="C2OUT" edc:ppsval="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U1TX" edc:ppsval="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U1RTS" edc:ppsval="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SCK1" edc:ppsval="8"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO1" edc:ppsval="8"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SS1" edc:ppsval="9"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC1" edc:ppsval="18"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC2" edc:ppsval="19"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="CTPLS" edc:ppsval="29"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="C3OUT" edc:ppsval="30"/>
    </edc:RemappablePin>
  </edc:PinList>
</edc:PIC>
